local _lng = {
'температура',
'влажность',
'давление',
'мм рт. ст.',
'ветер',
'м/с',
'облачность',
'Погода',
'в',
'дождь за 3ч:',
'снег за 3ч:',
}

local _wind = {
'северный',
'северо-восточный',
'восточный',
'юго-восточный',
'южный',
'юго-западный',
'западный',
'северо-западный'}

local _wind_s = {'C' ..string.char(0xE2,0x86,0x93),
				 'СВ'..string.char(0xE2,0x86,0x99),
				 'В' ..string.char(0xE2,0x86,0x90),
				 'ЮВ'..string.char(0xE2,0x86,0x96),
				 'Ю' ..string.char(0xE2,0x86,0x91),
				 'ЮЗ'..string.char(0xE2,0x86,0x97),
				 'З' ..string.char(0xE2,0x86,0x92),
				 'СЗ'..string.char(0xE2,0x86,0x98),
				 ''}

local _wind_s_xp = {'С','СВ','В','ЮВ','Ю','ЮЗ','З','СЗ'}

local _time_of_day2 = { "утро",   "день",    "вечер",   "ночь"    }	
local _time_of_day1 = {'%F3%F2%F0%EE',  '%E4%E5%ED%FC' , '%E2%E5%F7%E5%F0', '%ED%EE%F7%FC'}
local _time_of_day  = {'\243\242\240\238', '\228\229\237\252' , '\226\229\247\229\240', '\237\238\247\252'}

return _lng, _wind, _wind_s  , _wind_s_xp  , _time_of_day                
       