--  канал, программа

epgFilterTableFirst={
   {"НТВ HD", "НТВ", 0}
			   } --end epgFilterTableFirst
			   
-----------------------------------------------------------------------------			   
epgFilterTable={
  {"360° Подмосковье","360 Подмосковье", 0 } 
 ,{"Nautical Channel","Морской", 0 }
 ,{"ТВЦ (+4)","ТВЦ", 4 }
 ,{"РТР Планета Молдова","РТР Планета Украина", 0}
 ,{"ТВЦ Дальний Восток", "ТВЦ", 7}
 ,{"Авто 24", "Авто24", 0}
 ,{"Авто 24 HD", "Авто24 HD", 0}
 ,{"Авто24 HD", "Авто24", 0}
 ,{"Бобёр", "Бобер", 0}
 ,{"Вместе-РФ", "Вместе РФ", 0}
 ,{"Детский мир / Телеклуб", "Детский мир + Телеклуб", 0}
 ,{"Дом кино Премиум HD", "Дом Кино Премиум", 0}
 ,{"Дом кино Премиум (HD)", "Дом Кино Премиум", 0}
 ,{"Живая планета HD", "Живая планета", 0}
 ,{"Живая природа HD", "Живая природа", 0}
 ,{"ЖИВИ! HD", "ЖИВИ!", 0}
 ,{"Дождь HD", "Дождь", 0}
 ,{"КиноПремиум HD", "КиноПремиумHD", 0}
 ,{"Кинорейс 1", "Кинорейс 1 (НТВ)", 0}
 ,{"Кинорейс 2", "Кинорейс 2 (НТВ)", 0}
 ,{"КХЛ ТВ", "КХЛ", 0}
 ,{"ЛДПР ТВ", "ЛДПР.ТВ", 0}
 ,{"Ля-минор", "Ля Минор", 0}
 ,{"Матч ТВ",  "Матч!",0}
 ,{"Матч! HD", "Матч!", 0}
 ,{"Много ТВ", "МногоTV", 0}
 ,{"Много ТВ", "Много TV", 0}
 ,{"Москва-24", "Москва 24", 0}
 ,{"Надiя", "Надия", 0}
 ,{"Наше Любимое Кино","Любимое кино", 0}
 ,{"Настоящее Страшное ТВ", "Настоящее Страшное Телевидение", 0}
 ,{"Настоящее Страшное ТВ", "НСТ", 0}
 ,{"Настоящее Страшное Телевидение", "НСТ", 0}
 ,{"Наше HD", "НашеHD", 0}
 ,{"НТВ-Мир", "НТВ Мир", 0}
 ,{"НТВ+ 3D", "НТВ-ПЛЮС 3D", 0}
 ,{"НТВ+ 3D by Panasonic", "НТВ-ПЛЮС 3D", 0}
 ,{"Наш Футбол HD", "Наш Футбол", 0}
 ,{"Наш Футбол", "НТВ-ПЛЮС Наш Футбол", 0}
 ,{"Наш футбол HD", "НТВ-ПЛЮС Наш футбол", 0}
 ,{"Наш Футбол", "НТВ+ Наш Футбол", 0}
 ,{"Наш футбол HD", "НТВ+ Наш футбол HD", 0}
 ,{"Наш футбол HD", "НТВ+ Наш футбол", 0}
 ,{"НТВ+ Футбол 1", "НТВ-ПЛЮС Футбол 1", 0}
 ,{"НТВ+ Футбол 1", "НТВ-ПЛЮС Футбол", 0}
 ,{"НТВ+ Футбол 1 HD", "НТВ-ПЛЮС Футбол 1", 0}
 ,{"НТВ+ Футбол 1 HD", "НТВ-ПЛЮС Футбол 1 HD", 0}
 ,{"НТВ+ Футбол 1 HD", "НТВ-ПЛЮС Футбол (HD)", 0}
 ,{"НТВ+ Футбол 2", "НТВ-ПЛЮС Футбол 2", 0}
 ,{"НТВ+ Футбол 2 HD", "НТВ-ПЛЮС Футбол 2", 0}
 ,{"НТВ+ Футбол 2 HD", "НТВ-ПЛЮС Футбол 2 HD", 0}
 ,{"НТВ+ Футбол 3", "НТВ-ПЛЮС Футбол 3", 0}
 ,{"НТВ+ Футбол 3 HD", "НТВ-ПЛЮС Футбол 3", 0}
 ,{"НТВ+ Футбол 3 HD", "НТВ-ПЛЮС Футбол 3 HD", 0}
 ,{"НТВ+ Футбол 2 HD", "НТВ-ПЛЮС Футбол 2 (HD)", 0}
 ,{"НТВ+ Футбол 3 HD", "НТВ-ПЛЮС Футбол 3 (HD)", 0}
 ,{"НТВ+ Баскетбол", "НТВ-ПЛЮС Баскетбол", 0}
 ,{"НТВ+ Спорт плюс", "Спорт Плюс", 0}
 ,{"НТВ+ Спорт плюс", "НТВ-ПЛЮС Спорт плюс", 0}
 ,{"НТВ+ Спорт", "НТВ-ПЛЮС Спорт", 0}
 ,{"НТВ+ Теннис", "НТВ-ПЛЮС Теннис", 0}
 ,{"НТВ+ Наше Кино", "Наше Кино", 0}
 ,{"НТВ+ Наше Новое Кино", "Наше Новое Кино", 0}
 ,{"НТВ+ Кино союз", "Кино Союз", 0}
 ,{"НТВ+ Кино Плюс", "Кино Плюс", 0}
 ,{"НТВ+ Киноклуб", "Киноклуб", 0}
 ,{"НТВ+ Кинохит", "Кинохит", 0}
 ,{"НТВ+ Премьера", "Премьера", 0}
 ,{"Киноклуб","Киносвидание", 0}
 ,{"Премьера","Киносемья", 0}
 ,{"Комедия ТВ","Кинокомедия", 0}
 ,{"Киномикс","КИНО ПЛЮС", 0}
 ,{"КИНО ПЛЮС","Киномикс", 0}
 ,{"НТВ+ Кинохит","Кинохит", 0}
 ,{"НТВ+ Наше Кино","Родное кино", 0}
 ,{"Наше Новое Кино","Наше новое кино", 0}
 ,{"HD Кино","Кинопремьера HD", 0}
 ,{"ОТР", "Общественное телевидение России", 0}
 ,{"Охотник и Рыболов HD", "Охотник и Рыболов", 0}
 ,{"Первый канал", "Первый", 0}
 ,{"Первый канал HD", "Первый HD", 0}
 ,{"ПИК", "Первый интернет канал", 0}
 ,{"ПИК ТВ", "Первый интернет канал", 0}
 ,{"Первый интернет канал HD", "Первый интернет канал", 0}
 ,{"Психология 21", "Психология21", 0}
 ,{"Пятница!", "Пятница", 0}
 ,{"Пятый канал", "5 канал (Россия)", 0}
 ,{"Пятый канал", "5 канал", 0}
 ,{"РБК", "РБК ТВ", 0}
 ,{"РЕН ТВ - Репортёр", "РЕН ТВ-РЕПОРТЁР", 0}
 ,{"РЕН ТВ (+4) (Канск)", "РЕН ТВ", 4}
 ,{"РЕН ТВ 5 КАНАЛ", "РЕН ТВ", 4}
 ,{"Россия 2", "Россия 2 (Спорт)", 0}
 ,{"Россия Культура", "Россия К", 0}
 ,{"Санкт-Петербург", "Санкт-Петербург", 0}
 ,{"Спорт 1 HD", "Спорт 1 (HD)", 0}
 ,{"Спорт 1", "Спорт 1 (Россия)", 0}
 ,{"Спорт 1 HD", "Спорт 1 HD (Россия)", 0}
 ,{"СТС Мир", "СТС-Мир)", 0} 
 ,{"СТС Мир", "СТС - Мир)", 0}
 ,{"СТС Мир", "СТС (+3)", 0}
 ,{"СТС Мир", "СТС", 3}
 ,{"СТС Прима", "СТС-Прима", 0}
 ,{"СТС Прима", "СТС - Прима", 0}
 ,{"СТС Прима", "СТС", 4}
 ,{"СТС Прима", "СТС (+4)", 0}
 ,{"ТВЦ Международное", "ТВ-Центр-Международное", 0}
 ,{"ТВ 3", "ТВ-3", 0}
 ,{"ТВ3", "ТВ-3", 0}
 ,{"ТДК", "TDK", 0}
 ,{"ТНВ-планета", "ТНВ Планета", 0}
 ,{"Феникс+ кино", "Феникс+Кино", 0}
 ,{"Футбол", "Телеканал Футбол", 0}
 ,{"Футбол HD", "Футбол", 0}
 ,{"Футбол 1 HD (Украина)", "Футбол 1 (Украина)", 0}
 ,{"Футбол 2 HD (Украина)", "Футбол 2 (Украина)", 0}
 ,{"24 Док", "24Doc", 0}
 ,{"2х2", "2x2", 0}
 ,{"5 канал", "5 канал Украина", 0}
 ,{"5 канал", "5 канал (Украина)", 0}
 ,{"360° Подмосковье", "360° ПОДМОСКОВЬЕ HD", 0}
 ,{"365 дней", "365 дней ТВ", 0}
 ,{"Amazing Life", "Amazing Life (Удивительная жизнь)", 0}
 ,{"Amedia 1", "Amedia1", 0}
 ,{"Amedia 1 HD", "Amedia 1", 0}
 ,{"Amedia 2 HD", "Amedia 2", 0}
 ,{"Amedia Hit HD", "Amedia Hit", 0}
 ,{"Amedia Premium", "Amedia Premium SD", 0}
 ,{"CBS Drama", "CBS_Drama", 0}
 ,{"Da Vinci", "Da Vinci Learning", 0}
 ,{"Discovery Channel HD", "Discovery Channel", 0}
 ,{"Discovery Channel HD", "Discovery HD", 0}
 ,{"Disney Channel", "Канал Disney", 0}
 ,{"DuckTV HD", "DuckTV", 0}
 ,{"Eurosport HD", "Eurosport", 0}
 ,{"Eurosport 2 HD", "Eurosport 2", 0}
 ,{"FOX HD", "Fox", 0}
 ,{"FOX Life HD", "Fox Life", 0}
 ,{"FrenchLover TV", "French Lover", 0}
 ,{"HD Спорт", "HD Sport", 0}
 ,{"Hustler Blue", "Hustler Blue (Ночной канал)", 0}
 ,{"Hustler HD (3D)", "Hustler 3DHD", 0}
 ,{"INVA Media TV", "ИНВА МЕДИА ТВ", 0}
 ,{"L!FENEWS", "Lifenews", 0}
 ,{"L!FENEWS HD", "Lifenews", 0}
 ,{"L!FE", "Life", 0}
 ,{"L!FE HD", "Life", 0}
 ,{"Life HD", "Life", 0}
 ,{"Life 78", "LIFENEWS 78", 0} 
 ,{"Life 78 HD", "LIFENEWS 78", 0}
 ,{"Luxe.TV HD", "Luxe HD", 0}
 ,{"Luxe.TV", "Luxe TV", 0}
 ,{"myZen.tv HD", "myZen.tv", 0}
 ,{"myZen.tv HD", "Melody Zen TV", 0}
 ,{"Nano TV", "Нано ТВ", 0}
 ,{"News One", "NewsOne", 0}
 ,{"Nick Jr.", "Nick Jr", 0}
 ,{"O-la-la", "O la la", 0}
 ,{"Outdoor", "Outdoor Channel", 0}
 ,{"Outdoor Channel HD ", "Outdoor HD ", 0}
 ,{"Paramount Comedy", "Paramount Comedy Russia", 0}
 ,{"Paramount Comedy HD", "Paramount Comedy Russia", 0}
 ,{"QTV", "QTV (Куй ТВ)", 0}
 ,{"QTV", "Куй ТВ", 0}
 ,{"Russian Travel Guide", "RTG", 0}
 ,{"RTG", "Russian Travel Guide", 0}
 ,{"RTG HD", "Russian Travel Guide HD", 0}
 ,{"Russia Today HD", "Russia Today", 0}
 ,{"Russia Today Documentary", "RT Д (English)", 0}
 ,{"Russia Today Documentary", "Russia Today Doc (RT Doc)", 0}
 ,{"Russia Today Документальный", "RTД", 0}
 ,{"Russia Today Документальный HD", "Russia Today Документальный", 0}
 ,{"Russia Today Документальный HD", "RTД HD", 0}
 ,{"Russia Today Документальный", "RT Д (Russia)", 0}
 ,{"RU TV", "RU.TV", 0}
 ,{"TVM Channel", "TVMChannel", 0}
 ,{"SET", "Sony Entertainment Television", 0}
 ,{"Travel+ Adventure", "Travel+Adventure", 0}
 ,{"Travel+ Adventure", "Travel+Adventure HD", 0}
 ,{"TV XXI", "TV21", 0}
 ,{"TVM Channel", "TVMChannel", 0}
 ,{"Viasat 3 plus", "3+", 0}
 ,{"Viasat Explorer", "Viasat Explorer Россия", 0}
 ,{"Viasat History HD", "Viasat History", 0}
 ,{"Viasat Nature", "Viasat Nature CEE", 0}
 ,{"Viasat Sport HD", "Viasat Sport", 0}
 ,{"Viasat Sport HD", "Viasat_Sport", 0}
 ,{"Viasat Sport", "Viasat_Sport", 0}
 ,{"Viasat Sport", "Viasat Sport Россия", 0}
 ,{"Viasat Sport HD", "Viasat Sport Россия HD", 0}
 ,{"Vintage", "Vintage TV", 0}
 ,{"Zooпарк", "Зоопарк", 0}

}